{
    "about": {
        "title": "About",
        "paragraphs": [
            "I am a Senior Full-Stack Engineer who doesn't just write code—I architect systems that scale. With over 4.5 years of experience, I specialize in bridging the gap between high-performance backends and seamless, conversion-driven frontends.",
            "My approach balances technical depth with business impact. At Pickyourtrail, I architected a high-scale booking flow that drove a 150% increase in conversions. Prior to that, I focused on heavy infrastructure at Codedamn, where I optimized container pipelines to slash operational costs by 55%.",
            "Beyond the 9-to-5, I build complex distributed systems. I architected 'Artemis' (an AI OS using RabbitMQ and Vector DBs) and 'WatchWithMe' (a P2P streaming platform serving 3,000+ users). I function best in roles where I can own the end-to-end architecture—from the database schema to the pixel-perfect UI."
        ]
    },
    "experience": {
        "title": "Experience",
        "experiences": [
            {
                "date": "09/2024 - Current",
                "title": "Frontend Developer - SDE II",
                "company": "Pickyourtrail",
                "location": "Chennai, India",
                "highlights": [
                    "Directed development and delivery of major features including Static Reports and Ledger module",
                    "Revamped hotel search and booking flow on web and mobile, resulting in 150% increase in bookings",
                    "Shipped cross-platform capabilities for Preferred Hotels and Cirium integration"
                ]
            },
            {
                "date": "11/2023 - 11/2024",
                "title": "Fullstack Developer (Consultant)",
                "company": "BahiKhata Inc",
                "location": "Noida, India",
                "highlights": [
                    "Enabled offline sync functionality for Bahikhata mobile app",
                    "Implemented multi-session sync to help MSMEs organize transactions across multiple devices",
                    "Developed SMS parsing to automatically fetch and record transactions"
                ]
            },
            {
                "date": "02/2023 - 11/2023",
                "title": "Fullstack Developer",
                "company": "Klenty soft. inc.",
                "location": "Chennai, India",
                "highlights": [
                    "Implemented Zipkin distributed tracing to enhance performance measurement",
                    "Created instant mail tracking feature, reducing latency from 15 minutes to five seconds",
                    "Designed slow query tracking pipeline for infrastructure optimization"
                ]
            },
            {
                "date": "08/2022 - 02/2023",
                "title": "Senior Software Engineer (Infrastructure & IDE)",
                "company": "Codedamn",
                "location": "Bangalore, India",
                "highlights": [
                    "Optimized container allocation pipeline, achieving 55% reduction in operational costs",
                    "Boosted productivity by implementing autocomplete and intellisense features",
                    "Collaborated with instructors to develop data structure and algorithm code execution stack"
                ]
            },
            {
                "date": "03/2021 - 07/2022",
                "title": "Member of technical staff",
                "company": "Facilio",
                "location": "Chennai, India",
                "highlights": [
                    "Developed AI parser using template parsing to process over 6,000 payment receipts, enhancing product marketability",
                    "Created pivot table feature to aggregate data across modules, improving analysis capabilities",
                    "Added conditional formatting and calculated fields to increase pivot table functionality",
                    "Integrated parcel owner parsing from photo with Android and notification system for employee alerts"
                ]
            }
        ]
    },
    "skills": {
        "title": "Skills",
        "categories": [
            {
                "name": "Frontend",
                "skills": [
                    "TypeScript",
                    "JavaScript",
                    "React",
                    "React Native",
                    "Next.js",
                    "GraphQL",
                    "Performance Optimization"
                ]
            },
            {
                "name": "Backend & DevOps",
                "skills": [
                    "Node.js",
                    "PostgreSQL",
                    "MongoDB",
                    "Redis",
                    "AWS",
                    "CI/CD",
                    "GitHub Actions",
                    "Cloud Infrastructure"
                ]
            },
            {
                "name": "Other",
                "skills": [
                    "n8n",
                    "API Integration",
                    "Caching Solutions",
                    "API Design",
                    "System Architecture"
                ]
            }
        ]
    },
    "projects": {
        "title": "Projects",
        "projects": [
            {
                "title": "Job Genie",
                "date": "November 2025 – Present",
                "description": "AI-powered toolkit designed to help job seekers apply smarter, not harder. Includes tools for generating personalized cover letters, email builder, and resume optimization for senior roles.",
                "tags": [
                    "AI",
                    "Job Search",
                    "Automation"
                ],
                "liveUrl": "https://main.d1jgytnx6kv0u.amplifyapp.com",
                "imageUrl": "/job-genie.png"
            },
            {
                "title": "Artemis",
                "date": "October 2025 – Present",
                "description": "Personal productivity assistant built on n8n and Telegram. Integrates task management, note-taking, reminders, and Perplexity-powered research with voice interaction and calendar sync.",
                "tags": [
                    "Telegram Bot",
                    "n8n",
                    "Productivity"
                ],
                "githubUrl": "https://github.com/thelonewolf123/artemis-ai",
                "liveUrl": "https://artemis-ai-beta.vercel.app",
                "imageUrl": "/artemis.png"
            },
            {
                "title": "WatchWithMe.in",
                "date": "April 2024 – Present",
                "description": "Chrome extension and mobile app providing a theater-like movie-watching experience for long-distance couples. Features synchronized video playback with integrated voice and video chat.",
                "tags": [
                    "Chrome Extension",
                    "React Native",
                    "WebRTC"
                ],
                "stats": "4,000+ monthly active users • 14,000+ watch hours",
                "liveUrl": "https://www.watchwithme.in",
                "imageUrl": "/watchwithme.png"
            },
            {
                "title": "Stardust.app",
                "date": "April 2023 – Present",
                "description": "Proof-of-concept container deployment platform built on AWS Spot Instances. Added support for disaster management and one-command infrastructure provisioning with Pulumi.",
                "tags": [
                    "AWS",
                    "Containers",
                    "Infrastructure"
                ],
                "githubUrl": "https://github.com/thelonewolf123/stardust.app",
                "imageUrl": "/architecture.png"
            }
        ]
    },
    "blog": {
        "title": "Blog",
        "description": "I share my insights on frontend development, performance optimization, and building scalable applications.",
        "buttonText": "Read All Articles",
        "buttonUrl": "/blog"
    }
}